win95/RTOS-STM32f407/main.c
//******************************************************************************
#include "stm32f4xx.h"
#include "stm32f4xx_conf.h"
#include "discoveryf4utils.h"
//******************************************************************************
/* USER ...*/
#include "defines.h"
#include "tm_stm32f4_hd44780.h"
#include "tm_stm32f4_gpio.h"
#include "tm_stm32f4_usart.h"
#include "tm_stm32f4_watchdog.h"
#include "attributes.h"
#include "tm_stm32f4_delay.h"
#include "tm_stm32f4_ethernet.h"
#include "tm_stm32f4_exti.h"
#include "tm_stm32f4_fatfs.h"
#include "tm_stm32f4_rtc.h"
#include "stm32f4xx_rcc.h"
#include "tcp_echoclient.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>

//******************************************************************************
#include "FreeRTOS.h"
#include "queue.h"
#include "task.h"
#include "timers.h"
#include "croutine.h"
//******************************************************************************

/* Static IP ADDRESS: IP_ADDR0.IP_ADDR1.IP_ADDR2.IP_ADDR3 */
#ifndef MAC_ADDR0
#define MAC_ADDR0							0x08
#define MAC_ADDR1							0x00
#define MAC_ADDR2							0x69
#define MAC_ADDR3							0x02
#define MAC_ADDR4							0x00
#define MAC_ADDR5							0xF0
#endif

void vConfigure(void *pvParameters);
void vLedBlinkRed(void *pvParameters);
void vEthernet(void *pvParameters);
void vMain(void *pvParameters);
void printf_d(char *str);

/* Fatfs object */
FATFS FatFs;
/* File object */
FIL fil;
FRESULT fres;
DSTATUS disk_initialize (BYTE drv);
unsigned int turnsend=0;
unsigned int turnrecv=0;
char ACM[8];
/*Khoi LCD*/
	uint8_t customChar[] = {
//		0x1F,	/*  xxx 11111 */
//		0x11,	/*  xxx 10001 */
//		0x11,	/*  xxx 10001 */
//		0x11,	/*  xxx 10001 */
//		0x11,	/*  xxx 10001 */
//		0x11,	/*  xxx 10001 */
//		0x11,	/*  xxx 10001 */
//		0x1F	/*  xxx 11111 */
		0x00,	/*  xxx 11111 */
		0x00,	/*  xxx 10001 */
		0x00,	/*  xxx 10001 */
		0x00,	/*  xxx 10001 */
		0x00,	/*  xxx 10001 */
		0x00,	/*  xxx 10001 */
		0x00,	/*  xxx 10001 */
		0x00	/*  xxx 11111 */
	};
unsigned char flag_LCD = 0;
char buffer_lcd[32];
/*Khoi COM*/
char 					str[64];
char 					BufferCom1[64];
char 					BufferCom2[64];
char 					BufferCom3[64];
/*Khoi Rtc*/
TM_RTC_Time_t datatime;
static void 	updatime(uint8_t h,uint8_t m,uint8_t s,uint8_t d,uint8_t mon,uint8_t year);
unsigned char fag_updatime=0;
static void 	Sttup(char * buffer);
static void 	Timeup(char * buffer);
/*Khoi SW*/
void 					read_sw_add(void);
unsigned char value_dip =0; /* value DIP switch*/
/*Khoi Ethernet*/
char 					data_tcp[128];
typedef struct {	/* Create simple typedef for DNS controlling */
	uint8_t Working;
	uint8_t HaveIP;
	uint8_t ip[4];
} TM_DNS_t;

TM_DNS_t MyDNS;
uint16_t 			requests_count = 1;
uint8_t 			macaddress[24][6]	=	{
															{0x00,0xE0,0x69,0xF0,0x00,0x01}, 	//1
															{0x00,0xE0,0x69,0xF0,0x00,0x02},	
															{0x00,0xE0,0x69,0xF0,0x00,0x03},
															{0x00,0xE0,0x69,0xF0,0x00,0x04},
															{0x00,0xE0,0x69,0xF0,0x00,0x05},	//5
															{0x00,0xE0,0x69,0xF0,0x00,0x06},
															{0x00,0xE0,0x69,0xF0,0x00,0x07},
															{0x00,0xE0,0x69,0xF0,0x00,0x08},
															{0x00,0xE0,0x69,0xF0,0x00,0x09},
															{0x00,0xE0,0x69,0xF0,0x00,0x0A},	//10
															{0x00,0xE0,0x69,0xF0,0x00,0x0B},
															{0x00,0xE0,0x69,0xF0,0x00,0x0C},
															{0x00,0xE0,0x69,0xF0,0x00,0x0D},
															{0x00,0xE0,0x69,0xF0,0x00,0x0E},
															{0x00,0xE0,0x69,0xF0,0x00,0x0F},	//15
															{0x00,0xE0,0x69,0xF0,0x00,0x10},
															{0x00,0xE0,0x69,0xF0,0x00,0x11},
															{0x00,0xE0,0x69,0xF0,0x00,0x12},
															{0x00,0xE0,0x69,0xF0,0x00,0x13},
															{0x00,0xE0,0x69,0xF0,0x00,0x14},	//20
															{0x00,0xE0,0x69,0xF0,0x00,0x15},
															{0x00,0xE0,0x69,0xF0,0x00,0x16},
															{0x00,0xE0,0x69,0xF0,0x00,0x17},
															{0x00,0xE0,0x69,0xF0,0x00,0x18},	//24
														};
uint8_t 			ipadress[4]			=	{10,142,4,100};
uint8_t 			getwayadress[4]	=	{10,142,4,1};
uint8_t 			netmaskadress[4]=	{255,255,255,0};
uint8_t				serveradress[4]	=	{10,142,4,11};
uint16_t			portadress 		= 8866;
//char revdata[100];
//uint8_t lenrevdata=0;
unsigned int 		status_sv=0;			//lenh dk tu server la 0 1 2
unsigned char 	flag_status_sv=0;	// cho phep nhan lenh dk tu server.
unsigned char 	malenh_sv=0;
TM_TCPCLIENT_t *tcpclient;
/*Khoi process*/
unsigned char  	Process_1=0;		// xu li day len PC nhung.
unsigned char  	Process_2=0;		// xu li day len server.
/*Khoi RFID*/
unsigned char 	flag_RFID = 0;	/*Send SelectCard */		
unsigned char 	flag_RFID1=0;
unsigned char 	flag_RFID2=0;
unsigned char 	flag_wiegand=0;
char 						SelectCard[4]= 	{0xBA,0x02,0x01,0xB9};								// code hex dau doc the da nang
char 						Carpull[7]	=		{0x7F,0x40,0x01,0x20,0x0D,0xC0,0x00};	// code hex nuot the
char 						Carpush[7]	=		{0x7F,0x40,0x01,0x21,0x8D,0xC5,0x00};	// code hex nha the
char 						IDCAR1[7]	=			{0x00,0x00,0x00,0x00,0x00,0x00,0x00};	// luu gia tri IDCAR tu dau doc da nang
char 						UID1[30];
char 						UID1_save[30];
/*Khoi Action*/
void 						ProcessAction(void);
void 						Serveprocess(void);
/*Khoi Wait*/	
void 						WaitPC(unsigned int t);
unsigned char 	flag_PC=0;		// doi pc phan hoi va xu li xong du lieu nhan veroi moi bat
unsigned char 	flag_SV=0;		// doi server phan hoi va xu li xong du lieu nhan ve roi moi bat
/*Khoi VIP*/
char *vip_id[3] = {		// ma the vip
	"b7 7b 87 52",
	"04 4f 97 c6",
	"bc 71 85 49",
	};
/*time out*/
unsigned int 			timeout = 0;	// thoi gian active relay
volatile uint8_t 	counter = 0;
/* Khoi Ban phim */
unsigned char express;			// gia tri nhan duoc tu ban phim
unsigned char flag_dtmf =0;	
/*Khoi 485*/
int LEDStatus=0;						// the hien trang thai cua led hien thi
unsigned char flag_485 = 0;	// xu li trong ham chinh duoc set theo timer
/*Khoi flag*/
unsigned char flag_R10 =0;	// active relay 1
unsigned char flag_R20 =0;	// active relay 2
unsigned char flag_R11 =0;	// active relay 3
unsigned char flag_R21 =0;	// active relay 4
unsigned char flag_test=0;	// su dung khi gui lenh test tu cong com 
unsigned char flag_serve=0;	// su dung khi nhan lenh tu server
unsigned char flag_pass=0; 	// xac nhan di qua
unsigned char flag_passed=0;// xac nhan di qua roi
unsigned char flag_vip=0;		// su kien vip
static int check_vip(char * name);
/* Khoi OUTPUT*/
static int turn_on_dk1(void);
static int turn_off_dk1(void);

