win95/RTOS-STM32f407/main.c
	vTaskStartScheduler();
}
//******************************************************************************
//******************************************************************************
void vConfigure(void *pvParameters)
{
unsigned int config=0;
unsigned int config1=0;
unsigned int config2=0;
unsigned int config3=0;
unsigned int config4=0;
unsigned int config5=0;
unsigned int config6=0;
uint8_t key;
char str_config[20];
static uint8_t	cnt=0;
		TM_WATCHDOG_Reset();
	for(;;)
	{

if(flag_dtmf==1){
	key = express;
	if((key=='*')&&(config==0)) config =1;
	if(config==1){
		if((config1+config2+config3+config4+config5+config6)==0){
		if((key=='1')&&(config1==0)) config1=1;
		if((key=='2')&&(config2==0)) config2=1;
		if((key=='3')&&(config3==0)) config3=1;
		if((key=='4')&&(config4==0)) config4=1;
		if((key=='5')&&(config5==0)) config5=1;
		if((key=='6')&&(config6==0)) config6=1;
		cnt =0;
		memset(str_config,0,0);
		}
		if(config1==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh1\n");
		config =0;
		config1 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}
		if(config2==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh2\n");
		config =0;
		config2 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}
		if(config3==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh3\n");
		config =0;
		config3 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}
		if(config4==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh4\n");
		config =0;
		config4 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}
		if(config5==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh5\n");
		config =0;
		config5 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}
		if(config6==1){
		str_config[cnt] = key;
		cnt++;
		if(key=='#') { 
		printf_d("ket thuc chuoi lenh6\n");
		config =0;
		config6 =0;
		cnt=0;
		sprintf(str,"%s",str_config);
		printf_d(str);
		}}		
		}	
	if(key=='#') {
		config=0;
		memset(str_config,'\0',0);
	}
	flag_dtmf =0;	
}
	TM_WATCHDOG_Reset();
}
}
void vLedBlinkRed(void *pvParameters)
{
//	/* Free and total space */
//	uint32_t total, free;
//	static FRESULT rc;   /* Result code */  
//	static UINT bw, br, numread;
//    static BYTE buff[64];
//    BYTE Message[] = "HELLO" ; // message's content
//    TCHAR *FilePath = "MESSAGE.TXT" ; // file path
//		/* Mount drive */
//	if (f_mount(&FatFs, "0:", 1) == FR_OK) {
//		/* Mounted OK, turn on RED LED */
//		
//		/* Try to open file */
//		if (f_open(&fil,FilePath, FA_CREATE_ALWAYS | FA_READ | FA_WRITE | FA_OPEN_ALWAYS) == FR_OK) {
//			/* File opened, turn off RED and turn on GREEN led */
//			
////			/* If we put more than 0 characters (everything OK) */
////			if (f_puts("First string in my file\n", &fil) > 0) {
////				if (TM_FATFS_DriveSize(&total, &free) == FR_OK) {
////					/* Data for drive size are valid */
////				}
////			}
//    rc = f_write(&fil, Message, sizeof(Message)-1, &bw); // write file

//    if (!rc) {
//      sprintf(str,"write success. %u bytes written.\n\r", bw);
//			printf_d(str);
//    }else  {
//      sprintf(str,"write file Failure...error = %u\n\r",rc);
//			printf_d(str);
//    }			
//   sprintf(str,"\nClose the file writeen.\n\r");
//    printf_d(str);
//		taskENTER_CRITICAL ();
//		rc = f_close(&fil); // close file
//		taskEXIT_CRITICAL ();
//    if (!rc) {
//      sprintf(str,"File writeen closed success.\n\r");
//    printf_d(str);
//		}else  {
//      sprintf(str,"File close writeen was failure...error = %u\n\r",rc);
//    printf_d(str);
//		}
//		}
//		
//		/* Unmount drive, don't forget this! */
//		f_mount(0, "0:", 1);
//	}
		TM_WATCHDOG_Reset();
	for(;;)
	{
		if(tcpclient->state==CLIENT_CONNECTED){
		STM_EVAL_LEDToggle(LED_ORANGE);
		vTaskDelay(100 / portTICK_RATE_MS );
		}else{
		STM_EVAL_LEDToggle(LED_ORANGE);
		vTaskDelay(50 / portTICK_RATE_MS );
		}
	TM_WATCHDOG_Reset();		
	}
}

void vEthernet(void *pvParameters)
{	
	read_sw_add();
	ipadress[3]=ipadress[3]+value_dip;
	printf_d("Program starting..\n");
	if (TM_ETHERNET_Init(macaddress[value_dip],ipadress, getwayadress, netmaskadress) == TM_ETHERNET_Result_Ok) {
	printf_d("TM_ETHERNET_Init OK \n");
	}

		/* Reset watchdog */
	TM_WATCHDOG_Reset();
	for(;;)
	{
		/* Update ethernet, call this as fast as possible */
		TM_ETHERNET_Update();
		/* Reset watchdog */
		TM_WATCHDOG_Reset();
	}
	
}

void vMain(void *pvParameters)
{
	/* init DTMF*/
	TM_GPIO_Init(DTMF_BIT0_PORT, DTMF_BIT0_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
	TM_GPIO_Init(DTMF_BIT1_PORT, DTMF_BIT1_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
	TM_GPIO_Init(DTMF_BIT2_PORT, DTMF_BIT2_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
	TM_GPIO_Init(DTMF_BIT3_PORT, DTMF_BIT3_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
	/* DTMF*/
		if (TM_EXTI_Attach(DFMF_BIT4_PORT, DTMF_BIT4_PIN, TM_EXTI_Trigger_Rising) == TM_EXTI_Result_Ok) {
		printf_d("DFMF_BIT4 init\n");
	}	
	/*init interrup INPUT*/
		TM_EXTI_Attach(W2_D0_PORT, W2_D0_PIN, TM_EXTI_Trigger_Falling);
		TM_EXTI_Attach(W2_D1_PORT, W2_D1_PIN, TM_EXTI_Trigger_Falling);
		TM_EXTI_Attach(W1_D1_PORT, W1_D1_PIN, TM_EXTI_Trigger_Rising);
		TM_EXTI_Attach(W1_D0_PORT, W1_D0_PIN, TM_EXTI_Trigger_Rising);
	/*init interrup OPT*/
		TM_EXTI_Attach(OPT_PORT, 	OPT_PIN, TM_EXTI_Trigger_Falling);
/* int DIR 485 set = send , reset = recvice*/ 
	TM_GPIO_Init(CCU_DIR_PORT, CCU_DIR_PIN, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_High);
	TM_GPIO_SetPinHigh(CCU_DIR_PORT,CCU_DIR_PIN);
	/* Init LCD*/
	TM_GPIO_Init(HD44780_RW_PORT, HD44780_RW_PIN, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High);
	TM_GPIO_SetPinLow(HD44780_RW_PORT,HD44780_RW_PIN);
	read_sw_add();
	sprintf(ACM,"ACM%03d",value_dip);
	timeout = 1;
	memset(str,'\0',0);
	//Initialize LCD 20 cols x 4 rows
	TM_HD44780_Init(16,4);
	//Save custom character on location 0 in LCD
	TM_HD44780_CreateChar(0, &customChar[0]);    
	//Put string to LCD
	TM_HD44780_Puts(0, 0, "----TIS8-PRO----CreartebyR&D-TIS"); /* 0 dong 1, 1 dong 2*/
	TM_HD44780_Puts(0, 2, "-->Welcome");
	vTaskDelay(2000);
	TM_HD44780_Clear();
	sprintf(buffer_lcd,"Timerout %d", timeout);
	TM_HD44780_Puts(0, 0,buffer_lcd);
	vTaskDelay(2000);
	TM_HD44780_Clear();
	/* Print MAC address to user */
	sprintf(buffer_lcd,"ACM:%s ->IP\n\r%d.%d.%d.%d\n\r%02X-%02X-%02X\n\r%02X-%02X-%02X",
		ACM,
		TM_ETHERNET_GetLocalIP(0),
		TM_ETHERNET_GetLocalIP(1),
		TM_ETHERNET_GetLocalIP(2),
		TM_ETHERNET_GetLocalIP(3),
		TM_ETHERNET_GetMACAddr(0),
		TM_ETHERNET_GetMACAddr(1),
		TM_ETHERNET_GetMACAddr(2),
		TM_ETHERNET_GetMACAddr(3),
		TM_ETHERNET_GetMACAddr(4),
		TM_ETHERNET_GetMACAddr(5)
	);
	TM_HD44780_Puts(0, 0,buffer_lcd);
	vTaskDelay(3000);
	TM_HD44780_Clear();
	sprintf(buffer_lcd,"GW:%d.%d.%d.%d\n\rNet%d.%d.%d.%d",
		TM_ETHERNET_GetGateway(0),
		TM_ETHERNET_GetGateway(1),
		TM_ETHERNET_GetGateway(2),
		TM_ETHERNET_GetGateway(3),
		TM_ETHERNET_GetNetmask(0),
		TM_ETHERNET_GetNetmask(1),
		TM_ETHERNET_GetNetmask(2),
		TM_ETHERNET_GetNetmask(3)
	);
	TM_HD44780_Puts(0, 0,buffer_lcd);
	vTaskDelay(3000);
	TM_HD44780_Clear();
	flag_wiegand=0;	
	flag_RFID1=0;
// configure role mo rong
	turn_off_dk3();
	turn_off_dk4();
	/*end by duc*/
	TM_WATCHDOG_Reset();
	for(;;)
	{
/*process server control*/
/*process 485*/
	if(flag_485){
	flag_485=0;
	if(flag_pass!=0){
	flag_pass++;
	if(flag_pass>20) flag_pass=0;
	}
	if(LEDStatus==0){
	TM_USART_Puts(USART1, "/LED000>\r\n");
	}
	if(LEDStatus==1){
	TM_USART_Puts(USART1, "/LED001>\r\n");
	}
	if(LEDStatus==2){
	TM_USART_Puts(USART1, "/LED002>\r\n");
	}
	if(flag_pass!=0){
		if(tcpclient->state==1)sprintf(buffer_lcd,"Device:%s\n\rConnected....\n\rGaTE:Opened",ACM);
		else sprintf(buffer_lcd,"Device:%s\n\rNotConnect.\n\rGaTE:Opened",ACM);
		TM_HD44780_Puts(0, 0,buffer_lcd);
	}
	else{
		if(tcpclient->state==1)sprintf(buffer_lcd,"Device:%s\n\rConnected....\n\rGaTE:Close\n\rID:............",ACM);
		else sprintf(buffer_lcd,"Device:%s\n\rNotConnect.\n\rGaTE:Close\n\rID:............",ACM);
		TM_HD44780_Puts(0, 0,buffer_lcd);
	}

	/*try configure server*/
	if(flag_passed==1){
	sprintf(data_tcp,"(2,%s,%s,1,,%d-%d-%d/%d-%d-%d)",ACM,UID1_save,datatime.hours,datatime.minutes,datatime.seconds,datatime.date,datatime.month,datatime.year);
	vTaskDelay(10);
	TM_ETHERNETCLIENT_Connect("server",serveradress[0],serveradress[1],serveradress[2],serveradress[3],portadress,&requests_count);
	}	
	if(malenh_sv==2){
		
