win95/RTOS-STM32f407/main.c
		}
	}	

///*xu li 1 tien trinh hoan chinh*/
//	if(Process_1!=1 && Process_2!=1) TM_HD44780_Puts(0,3,"Wait for Card"); /* 0 dong 1, 1 dong 2*/
//	else TM_HD44780_Puts(0,3,"Door actived");
/*xu li khi co su kien nhan the*/
if((flag_RFID1==1)&&(flag_pass==0)){			
		Process_1=1;
		Process_2=1;
		IDCAR1[0]=BufferCom1[4];
		IDCAR1[1]=BufferCom1[5];
		IDCAR1[2]=BufferCom1[6];
		IDCAR1[3]=BufferCom1[7];
		IDCAR1[4]=BufferCom1[8];
		IDCAR1[5]=BufferCom1[9];
		IDCAR1[6]=BufferCom1[10];
		
		if(BufferCom1[1]==0x08)	
			{
			sprintf(UID1,"%02x %02x %02x %02x",IDCAR1[0],IDCAR1[1],IDCAR1[2],IDCAR1[3]);
			}
		if(BufferCom1[1]==0x0B) 
			{
			sprintf(UID1,"%02x %02x %02x %02x %02x %02x %02x",IDCAR1[0],IDCAR1[1],IDCAR1[2],IDCAR1[3],IDCAR1[4],IDCAR1[5],IDCAR1[6]);
			}
		vTaskDelay(20);
		if(check_vip(UID1)){
			flag_PC=1;
			flag_SV=1;
			flag_R10=1;
			timerdk1 =0;
			flag_R21=1;
			timerdk4 =0;
			Process_1=0;
			Process_2=0;
			flag_vip=1;
		}
		else{
		if(Process_1){
			if(UID1 != NULL){
				vTaskDelay(10);
				//TM_USART_Puts(USART3,UID1);
				sprintf(UID1_save,"ID:%s",UID1);
				TM_HD44780_Puts(0, 3,UID1_save);
				memset(UID1,NULL,0);
			}
		}
		if(Process_2){
			if(UID1 != NULL){
				sprintf(data_tcp,"(1,%s,%s,1,,%d-%d-%d/%d-%d-%d)",ACM,UID1,datatime.hours,datatime.minutes,datatime.seconds,datatime.date,datatime.month,datatime.year);
				TM_ETHERNETCLIENT_Connect("server",serveradress[0],serveradress[1],serveradress[2],serveradress[3],portadress,&requests_count);
				vTaskDelay(10);
				sprintf(UID1_save,"ID:%s",UID1);
				TM_HD44780_Puts(0, 3,UID1_save);
				memset(UID1,NULL,0);
			}
		}
		}
		WaitPC(300);
		flag_RFID1=0;
		
		if(flag_PC){
			flag_PC=0;
			ProcessAction();
			WaitPC(10);
		}
		else Process_1=0;
		
		if(flag_SV){ // duoc bat len trong luc cho doi.
			flag_SV=0;
			Serveprocess();
			WaitPC(10);
		}
		else Process_2=0;		
		flag_RFID1=0;	
		flag_test=0;
		flag_serve=0;
	}

if((flag_wiegand==1&&(flag_pass==0))){
		Process_1=1;
		Process_2=1;		
		sprintf(UID1,"%02x %02x %02x %02x",IDCAR1[3],IDCAR1[2],IDCAR1[1],IDCAR1[0]);
		vTaskDelay(20);
		if(check_vip(UID1)){
			flag_PC=1;
			flag_SV=1;
			flag_R10=1;
			timerdk1 =0;
			flag_R21=1;
			timerdk4 =0;
			Process_1=0;
			Process_2=0;
			flag_vip=1;
		}
		else{
		if(Process_1){
			if(UID1 != NULL){
				vTaskDelay(10);
				//TM_USART_Puts(USART3,UID1);
				sprintf(UID1_save,"ID:%s",UID1);
				TM_HD44780_Puts(0, 3,UID1_save);
				memset(UID1,NULL,0);
			}
		}
		if(Process_2){
			if(UID1 != NULL){
				sprintf(data_tcp,"(1,%s,%s,1,,%d-%d-%d/%d-%d-%d)",ACM,UID1,datatime.hours,datatime.minutes,datatime.seconds,datatime.date,datatime.month,datatime.year);
				TM_ETHERNETCLIENT_Connect("server",serveradress[0],serveradress[1],serveradress[2],serveradress[3],portadress,&requests_count);
				vTaskDelay(10);
				sprintf(UID1_save,"ID:%s",UID1);
				TM_HD44780_Puts(0, 3,UID1_save);
				memset(UID1,NULL,0);
			}
		}
		}
		WaitPC(300);
		flag_wiegand=0;
		
		if(flag_PC){
			flag_PC=0;
			ProcessAction();
			WaitPC(10);
		}
		else Process_1=0;
		
		if(flag_SV){ // duoc bat len trong luc cho doi.
			flag_SV=0;
			Serveprocess();
			WaitPC(10);
		}
		else Process_2=0;		
		flag_wiegand=0;	
		flag_test=0;
		flag_serve=0;
}
if(flag_serve==1){
	flag_serve=0;
	Serveprocess();
}	
if(flag_test==1) {
	flag_test=0;
	ProcessAction();
}

/* Quan li thoi gian cho tung su kien relay actived*/
timer_dk1 = timerdk1/2;	
if (timer_dk1 >= timeout){
			turn_off_dk1();
			flag_R10 =0;
			timerdk1=0;
			timer_dk1=0;
			flag_RFID1=0;
			flag_wiegand=0;
			Process_1=0;
			Process_2=0;
			WaitPC(100);
		}
timer_dk2 = timerdk2/2;
if (timer_dk2 >= timeout){
			turn_off_dk2();
			flag_R20 =0;
			timerdk2=0;
			timer_dk2=0;
			flag_RFID1=0;
			flag_wiegand=0;
			Process_1=0;
			Process_2=0;
			WaitPC(100);
		}
timer_dk3 = timerdk3;
if (timer_dk3 >= 4){
			turn_off_dk3();
			flag_R11 =0;
			timerdk3=0;
			timer_dk3=0;
			if(LEDStatus==0) {Process_1=0;Process_2=0;WaitPC(100);}
		}
timer_dk4 = timerdk4;
if (timer_dk4 >= 4){
			turn_off_dk4();
			flag_R21 =0;
			timer_dk4=0;
			timerdk4=0;
			if(LEDStatus==0) {Process_1=0;Process_2=0;WaitPC(100);}
		}


		TM_WATCHDOG_Reset();
}
	}
//******************************************************************************
/* Tran duc code*/
void  				printf_d(char *str){
	//TM_USART_Puts(USART3,str);
}
void 					ProcessAction(void){
		if(strncmp(BufferCom3,"R10",3)==0) // mo relay 1
	{
		flag_R10=1;
		timerdk1 =0;
	}
		if(strncmp(BufferCom3,"R20",3)==0) // mo relay 2
	{
		flag_R20=1;
		timerdk2 =0;
	}
		if(strncmp(BufferCom3,"R11",3)==0) // nuot the mo relay 3
	{
		flag_R11=1;
		timerdk3 =0;
	}
		if(strncmp(BufferCom3,"R21",3)==0) // nha the mo relay 4
	{
		flag_R21=1;
		timerdk4 =0;
	}
		if(strncmp(BufferCom3,"R00",3)==0) // TEST
	{
	TM_USART_Puts(USART3,"OK");
	}
		if(flag_R10)
	{		// active relay 1
		turn_on_dk1();
	}
		if(flag_R20)
	{	// active relay 2
		turn_on_dk2();
	}
		if(flag_R11)
	{	// active relay 3
		turn_on_dk3();
	}
		if(flag_R21)
	{	// active relay 4
		turn_on_dk4();
	}
	
/*Update time*/

	if(flag_R10) timer_dk1 = timerdk1/2;

	if(flag_R20) timer_dk2 = timerdk2/2;

	if(flag_R11) timer_dk3 = timerdk3;

	if(flag_R21) timer_dk4 = timerdk4;
}

void 					Serveprocess(){
	if(flag_status_sv){
	flag_status_sv=0;
	if(	status_sv==1)				//mo relay 1 va 3
	{
		flag_R10=1;
		timerdk1 =0;
		flag_R11=1;
		timerdk3 =0;
	}
		if(status_sv==2)				//mo relay 1 va 4
	{
		flag_R10=1;
		timerdk1 =0;
		flag_R21=1;
		timerdk4 =0;		
	}
		if(status_sv==3)				// mo relay 3
	{
		flag_R11=1;
		timerdk3 =0;		
	}	
		if(status_sv==4)				// mo relay 4
	{
		flag_R21=1;
		timerdk4 =0;		
	}
}
		if(flag_R10)
	{		// active relay 1
		turn_on_dk1();
	}
		if(flag_R20)
	{	// active relay 2
		turn_on_dk2();
	}
		if(flag_R11)
	{	// active relay 3
		turn_on_dk3();
	}
		if(flag_R21)
	{	// active relay 4
		turn_on_dk4();
	}
	
/*Update time*/

	if(flag_R10) timer_dk1 = timerdk1/2;

	if(flag_R20) timer_dk2 = timerdk2/2;

	if(flag_R11) timer_dk3 = timerdk3;

	if(flag_R21) timer_dk4 = timerdk4;
}
void 					WaitPC(unsigned int t){
	unsigned long int n=0;
	while(n<=t){
	vTaskDelay(10);
	if(flag_PC==1||flag_SV==1)
		{
			break;
		}
	n++;
	}
}
void 					TM_USART3_ReceiveHandler(uint8_t c) {	// PC
	static uint8_t cnt=0;
	if(c=='R')cnt=0;
	BufferCom3[cnt]=c;
	if(cnt==2){flag_test=1;} // recive 3 ki tu.
	if((cnt==2)&&(Process_1==1))flag_PC=1;
	if(cnt<48)cnt++;
	else cnt =0;
}
void 					TM_USART6_ReceiveHandler(uint8_t c) {	// RFID1
	static uint8_t cnt=0;
	if(c==0xBD)cnt=0;
	BufferCom1[cnt]=c;
	if((BufferCom1[3]==0x00)&&(cnt==BufferCom1[3]+1)&&cnt)
	{
		if(Process_1==0 && Process_2==0 && flag_pass ==0)flag_RFID1=1; // cho phep xu li du lieu xi tien trinh da ok
		memset(BufferCom1,'\0',0);
	}
	if(cnt<48)cnt++;
}
uint16_t 			TM_ETHERNETCLIENT_CreateHeadersCallback(TM_TCPCLIENT_t* connection, char* buffer, uint16_t buffer_length) {
	sprintf(buffer,"%s",data_tcp);
	turnsend ++;
	return strlen(buffer);
}

void 					TM_ETHERNETCLIENT_ReceiveDataCallback(TM_TCPCLIENT_t* connection, uint8_t* buffer, uint16_t buffer_length, uint16_t total_length) {
	static int i=0;
	static const char *s2 = "(,)";
	static char *buffer1;
	static char *token;
	memset(buffer1,0,0);
	buffer1=(char*)buffer;
	token = strtok(buffer1,s2);
	/* We have available data for connection to receive */
	sprintf(str,"Receiveing %d bytes of data from %s\n", buffer_length, connection->name);
	printf_d(str);
	turnrecv++;

