win95/RTOS-STM32f407/main.c
	/* Print data */
	for (i=0;i<buffer_length;i++) {
		/* Print response */
		sprintf(str,"%c", buffer[i]);
		printf_d(str);
		//revdata[i]=buffer[i];
	}
	sprintf(str,"thu hien tach :\n");
	printf_d(str);
	 /* walk through other tokens */
   for (i=0;i<6;i++) 
   {	
			switch(i){
				case 0: {
					sprintf(str,"%s,",token);
					malenh_sv=atoi(str);
					printf_d(str);
				}break;
				case 1: {
					sprintf(str,"%s,",token); 
					printf_d(str);
				}break;
				case 2: {
					sprintf(str,"%s,",token); 	
					printf_d(str);
				}break;
				case 3: {
					sprintf(str,"%s,",token);//cong wiegand mac dinh 1 
					printf_d(str);
				}break;
				case 4: {										// Ma lenh dieu khien tu server.
					sprintf(str,"%s,",token); 
					printf_d(str);
					Sttup("0-0-0-0-1");
					//Sttup(str);
					vTaskDelay(10);
				}break;	
				case 5: {										// datetime server.
					sprintf(str,"%s",token); 
					printf_d(str);
					Timeup(str);
				}break;
				default:break;
			}
			token = strtok(NULL, s2);	
   }
	memset(buffer1,0,0);
	memset(buffer,0,0);
	if(malenh_sv==1){
	flag_serve=1;				// xu li trong ham chinh.
	flag_SV=1;
	}
	if(malenh_sv==2){
		flag_passed=0;
	}
	connection->headers_done = 1;
	tcpclient=connection;
}

void 					TM_ETHERNETCLIENT_ConnectedCallback(TM_TCPCLIENT_t* connection) {
	/* We are connected */
	sprintf(str,"We are connected to %s\n", connection->name);
	printf_d(str);
	tcpclient=connection;
}

void 					TM_ETHERNETCLIENT_ConnectionClosedCallback(TM_TCPCLIENT_t* connection, uint8_t success) {
	/* We are disconnected, done with connection */
	if (success) {
	sprintf(str,"Connection %s was successfully closed. Number of active connections: %d\n", connection->name, *connection->active_connections_count);
	printf_d(str);
	} 
	else {
	sprintf(str,"Connection %s was closed because of error. Number of active connections: %d\n", connection->name, *connection->active_connections_count);
	printf_d(str);
	}	
	/* Increase number of requests */
	tcpclient=connection;
	requests_count++;
}

void 					TM_ETHERNETCLIENT_ErrorCallback(TM_TCPCLIENT_t* connection) {
	/* Print to user */
	sprintf(str,"An error occured on connection %s\n", connection->name);
	printf_d(str);
	tcpclient=connection;
}

void 					TM_ETHERNETCLIENT_ConnectionStartedCallback(TM_TCPCLIENT_t* connection) {
	/* Print to user */
	sprintf(str,"Connection %s has started\n", connection->name);
	printf_d(str);
	tcpclient=connection;
}

/* DNS has IP */
void TM_ETHERNETDNS_FoundCallback(char* host_name, uint8_t ip_addr1, uint8_t ip_addr2, uint8_t ip_addr3, uint8_t ip_addr4) {
//	/* If host name is stm32f4-discovery.com */
//	if (strstr(host_name, "stm32f4-discovery.com")) {
//		/* We have IP */
//		MyDNS.HaveIP = 1;
//		/* Save IP */
//		MyDNS.ip[0] = ip_addr1;
//		MyDNS.ip[1] = ip_addr2;
//		MyDNS.ip[2] = ip_addr3;
//		MyDNS.ip[3] = ip_addr4;
//		/* We are not working anymore */
//		MyDNS.Working = 0;
		
//		/* Print to user */
//		sprintf(str,"We have IP address for %s: %d.%d.%d.%d\n", host_name, ip_addr1, ip_addr2, ip_addr3, ip_addr4);
//		printf_d(str);
//	}
}

/* DNS error callback */
void 					TM_ETHERNETDNS_ErrorCallback(char* host_name) {
//	/* If host name is stm32f4-discovery.com */
//	if (strstr(host_name, "stm32f4-discovery.com")) {
//		/* We have IP */
//		MyDNS.HaveIP = 0;
//		/* We are not working anymore */
//		MyDNS.Working = 0;
//	}
//	/* Print to user */
//	sprintf(str,"DNS has failed to get IP address for %s\n", host_name);
//	printf_d(str);
}


void 					TM_ETHERNET_IPIsSetCallback(uint8_t ip_addr1, uint8_t ip_addr2, uint8_t ip_addr3, uint8_t ip_addr4, uint8_t dhcp) {
	/* Called when we have valid IP, it might be static or DHCP */
	
	if (dhcp) {
		/* IP set with DHCP */
		sprintf(str,"IP: %d.%d.%d.%d assigned by DHCP server\n", ip_addr1, ip_addr2, ip_addr3, ip_addr4);
		printf_d(str);
	} else {
		/* Static IP */
		sprintf(str,"IP: %d.%d.%d.%d; STATIC IP used\n", ip_addr1, ip_addr2, ip_addr3, ip_addr4);
		printf_d(str);
	}
	
	/* Print MAC address to user */
	sprintf(str,"MAC: %02X-%02X-%02X-%02X-%02X-%02X\n",
		TM_ETHERNET_GetMACAddr(0),
		TM_ETHERNET_GetMACAddr(1),
		TM_ETHERNET_GetMACAddr(2),
		TM_ETHERNET_GetMACAddr(3),
		TM_ETHERNET_GetMACAddr(4),
		TM_ETHERNET_GetMACAddr(5)
	);
	sprintf(str,"MAC: %02X-%02X-%02X-%02X-%02X-%02X\n",
		TM_ETHERNET_GetMACAddr(0),
		TM_ETHERNET_GetMACAddr(1),
		TM_ETHERNET_GetMACAddr(2),
		TM_ETHERNET_GetMACAddr(3),
		TM_ETHERNET_GetMACAddr(4),
		TM_ETHERNET_GetMACAddr(5)
	);




	/* Print 100M link status, 1 = 100M, 0 = 10M */
	sprintf(str,"Link 100M: %d\n", TM_ETHERNET.speed_100m);
	printf_d(str);
//	TM_USART_Puts(USART6,"Link 100M: %d\n", TM_ETHERNET.speed_100m);
	/* Print duplex status: 1 = Full, 0 = Half */
	sprintf(str,"Full duplex: %d\n", TM_ETHERNET.full_duplex);
	printf_d(str);
//	TM_USART_Puts(USART6,"Full duplex: %d\n", TM_ETHERNET.full_duplex);
}


void 					TM_ETHERNET_LinkIsDownCallback(void) {
	/* This function will be called when ethernet cable will not be plugged */
	/* It will also be called on initialization if connection is not detected */
}

void 					TM_ETHERNET_LinkIsUpCallback(void) {
	/* Cable has been plugged in back, link is detected */
	/* I suggest you that you reboot MCU here */
	/* Do important stuff before */
}
void 					TM_ETHERNET_SystemResetCallback(void) {
		TM_ETHERNET_Init(NULL, ipadress, getwayadress, netmaskadress);
}
/* Delay 1ms handler */
void 					TM_DELAY_1msHandler(void) {
	/* Time update for ethernet, 1ms */
	/* Add 1ms time for ethernet */
	TM_ETHERNET_TimeUpdate(1);
}
void 					vTimerCallback1( xTimerHandle  pxTimer ){
	long lArrayIndex;
     /* Optionally do something if the pxTimer parameter is NULL. */
     configASSERT( pxTimer );

     /* Which timer expired? */
     lArrayIndex = ( long ) pvTimerGetTimerID( pxTimer );

     /* Increment the number of times that pxTimer has expired. */
     lExpireCounters[ lArrayIndex ] += 1;
		flag_485=1;
		TM_RTC_GetDateTime(&datatime, TM_RTC_Format_BIN);
		if(flag_R10){
			timerdk1++;
		}
		if(flag_R20){ 
			timerdk2++;	
		}
		if(flag_R11){ 
			timerdk3++;
		}
		if(flag_R21){
			timerdk4++;
		}
 }
void 					vTimerCallback2( xTimerHandle  pxTimer ){	// mail
	long lArrayIndex;
     /* Optionally do something if the pxTimer parameter is NULL. */
     configASSERT( pxTimer );

     /* Which timer expired? */
     lArrayIndex = ( long ) pvTimerGetTimerID( pxTimer );

