win95/RTOS-STM32f407/main.c
     /* Increment the number of times that pxTimer has expired. */
     lExpireCounters[ lArrayIndex ] += 1;
		TM_USART_Puts(USART6,SelectCard);
 }
void 					vTimerCallback3( xTimerHandle  pxTimer ){ 	// Read wiegand 1. 10ms
		static uint32_t countTimeOut1 = 0;
		long lArrayIndex;
     /* Optionally do something if the pxTimer parameter is NULL. */
     configASSERT( pxTimer );

     /* Which timer expired? */
     lArrayIndex = ( long ) pvTimerGetTimerID( pxTimer );

     /* Increment the number of times that pxTimer has expired. */
     lExpireCounters[ lArrayIndex ] += 1;
		
		 if(count_1 > 0){
			 countTimeOut1++;
		 }
		 if(crc_34bit(count_1,card_1)){
			 uint32_t card_buf = 0;			 
				card_1 >>= 1;
				card_1 &= 0xFFFFFFFF;
				card_buf = (uint32_t)(card_1&0xFFFFFFFF);
				IDCAR1[0] = (uint8_t)(card_buf);
				IDCAR1[1] = (uint8_t)(card_buf >> 8);
				IDCAR1[2] = (uint8_t)(card_buf >> 16);
				IDCAR1[3] = (uint8_t)(card_buf >> 24);
//				sprintf(str,"%02x %02x %02x %02x",IDCAR1[3],IDCAR1[2],IDCAR1[1],IDCAR1[0]);
//				printf_d(str);
				countTimeOut1 = 0;
				card_1 = 0;
				count_1 = 0;
				flag_finish_1 = 1;
				if(flag_pass==0)flag_wiegand=1; // cho phep xu li du lieu xi tien trinh da ok
		 }	
				if(countTimeOut1 >= 5){ // 50ms ( gioi han thoi gian nhan du lieu 
			 flag_finish_1 = 0;
			 countTimeOut1 = 0;
			 card_1 = 0;
			 count_1 = 0;			 
			 flag_finish_1 = 1;
		 }
 }
void 					vTimerCallback4( xTimerHandle  pxTimer ){	// Read wiegang 2. 10ms
		static uint32_t countTimeOut2 = 0;
		long lArrayIndex;
     /* Optionally do something if the pxTimer parameter is NULL. */
     configASSERT( pxTimer );

     /* Which timer expired? */
     lArrayIndex = ( long ) pvTimerGetTimerID( pxTimer );

     /* Increment the number of times that pxTimer has expired. */
     lExpireCounters[ lArrayIndex ] += 1;	

			if(count_2 > 0){
			 countTimeOut2++;
			}
			if(crc_34bit(count_2,card_2)){
			 uint32_t card_buf = 0;
			 uint8_t buffArrCard[4];
			 
				card_1 >>= 1;
				card_1 &= 0xFFFFFFFF;
				card_buf = (uint32_t)(card_1&0xFFFFFFFF);
				buffArrCard[0] = (uint8_t)(card_buf);
				buffArrCard[1] = (uint8_t)(card_buf >> 8);
				buffArrCard[2] = (uint8_t)(card_buf >> 16);
				buffArrCard[3] = (uint8_t)(card_buf >> 24);

				sprintf(str,"w2,%02X%02X%02X%02X",buffArrCard[3],buffArrCard[2],buffArrCard[1],buffArrCard[0]);
				countTimeOut2 = 0;
				card_2 = 0;
				count_2 = 0;
				flag_finish_2 = 1;					
		 }
 }
void 					TM_EXTI_Handler(uint16_t GPIO_Pin) {			// Interrupt ext
	/* Handle external line 0 interrupts */
	if (GPIO_Pin == DTMF_BIT4_PIN) {
		
		if(TM_GPIO_GetInputPinValue(DTMF_BIT0_PORT, DTMF_BIT0_PIN)==0){ // Q1  =0
			if(TM_GPIO_GetInputPinValue(DTMF_BIT1_PORT, DTMF_BIT1_PIN)==0){//  Q2 =0
				if(TM_GPIO_GetInputPinValue(DTMF_BIT2_PORT, DTMF_BIT2_PIN)==0){// Q3 =0
					if(TM_GPIO_GetInputPinValue(DTMF_BIT3_PORT, DTMF_BIT3_PIN)==0)// Q4 =0 Q321=0 
						express = 'D';
					else express = '8';
						}
				else{ // Q1 =0,Q2=0,Q3=1
					if(TM_GPIO_GetInputPinValue(DTMF_BIT3_PORT, DTMF_BIT3_PIN)==0)
								express = '4';
					else express = '#';
						}
			}
			else //Q1=0,Q2=1,
			{
				if(TM_GPIO_GetInputPinValue(DTMF_BIT2_PORT, DTMF_BIT2_PIN)==0){// Q3 =0
					if(TM_GPIO_GetInputPinValue(DTMF_BIT3_PORT, DTMF_BIT3_PIN)==0)// Q4 =0  
						express = '2';
					else express = '0';
						}
				else{ // Q1 =0,Q2=1,Q3=1
					if(TM_GPIO_GetInputPinValue(DTMF_BIT3_PORT, DTMF_BIT3_PIN)==0)
								express = '6';
					else 	express = 'B';
				}
			}
		}
		else{					//Q1=1
				if(TM_GPIO_GetInputPinValue(DTMF_BIT1_PORT, DTMF_BIT1_PIN)==0){//  Q2 =0
					if(TM_GPIO_GetInputPinValue(DTMF_BIT2_PORT, DTMF_BIT2_PIN)==0){// Q3 =0
						if(TM_GPIO_GetInputPinValue(DTMF_BIT3_PORT, DTMF_BIT3_PIN)==0)// Q4 =0 
						express = '1';
						else express = '9';
						}
					else{ // Q1 =1,Q2=0,Q3=1
				if(TM_GPIO_GetInputPinValue(DTMF_BIT3_PORT, DTMF_BIT3_PIN)==0)
								express = '5';
					else express = 'A';
					}
				}
				else //Q1=1,Q2=1,
				{
				if(TM_GPIO_GetInputPinValue(DTMF_BIT2_PORT, DTMF_BIT2_PIN)==0){// Q3 =0
					if(TM_GPIO_GetInputPinValue(DTMF_BIT3_PORT, DTMF_BIT3_PIN)==0)// Q4 =0  
						express = '3';
					else express = '*';
						}
				else{ // Q1 =1,Q2=1,Q3=1
					if(TM_GPIO_GetInputPinValue(DTMF_BIT3_PORT, DTMF_BIT3_PIN)==0)
						express = '7';
					else express = 'C';
				}
			}
		}
		flag_dtmf=1;
		TM_USART_Putc(USART3,express);
		/* Toggle RED led */
//		TM_DISCO_LedToggle(LED_RED);
//		/* Check counter */
//		if (++counter >= 10) {
//			/* Detach external interrupt for GPIO_Pin_0 no matter on which GPIOx is connected */
//			TM_EXTI_Detach(GPIO_Pin_0);
//		}
	}
	
//	/* Handle external line 13 interrupts */
	
	if (GPIO_Pin == W1_D0_PIN) { // run W1 D0
		if(flag_finish_1&&(LEDStatus==0)){
		card_1 <<= 1;
		count_1++;	
	}
	}
	if (GPIO_Pin == W1_D1_PIN) {	// run W1 D1
	if(flag_finish_1&&(LEDStatus==0)){
		card_1 <<= 1;
		card_1 |= 1;
		count_1++;	
	}
		
	}
	if (GPIO_Pin == W2_D0_PIN) {
		if(flag_finish_1&&(LEDStatus==0)){
		card_1 <<= 1;
		count_1++;	
	}
	}
	if (GPIO_Pin == W2_D1_PIN) {
	if(flag_finish_1&&(LEDStatus==0)){
		card_1 <<= 1;
		card_1 |= 1;
		count_1++;	
	}
	}

	if (GPIO_Pin == OPT_PIN) { // ngat cac cong 
	if((flag_pass!=0)&&(flag_vip==0)){
	sprintf(data_tcp,"(2,%s,%s,1,,%d-%d-%d/%d-%d-%d)",ACM,UID1_save,datatime.hours,datatime.minutes,datatime.seconds,datatime.date,datatime.month,datatime.year);
	vTaskDelay(10);
	TM_ETHERNETCLIENT_Connect("server",serveradress[0],serveradress[1],serveradress[2],serveradress[3],portadress,&requests_count);	
	flag_passed=1;
	}
	timerdk1=(timeout*2);
	timerdk2=(timeout*2);
	flag_vip=0;
	flag_pass=0;
	flag_RFID1=0;
	flag_wiegand=0;
}
}
/* Called on wakeup interrupt RTC*/
void 					TM_RTC_RequestHandler() {									// Interrupt rtc
	datatime.unix--;
	fag_updatime=1;
	turn_off_dk3();
	turn_off_dk4();
}
void 					read_sw_add(void){												// Read switch 8 bit
	unsigned int sw_add[8];
	if(GPIO_ReadInputDataBit(ADD_BIT0_PORT,ADD_BIT0_PIN)==0) sw_add[0] = 1;
			else sw_add[0] = 0;
	if(GPIO_ReadInputDataBit(ADD_BIT1_PORT,ADD_BIT1_PIN)==0) sw_add[1] = 1;
			else sw_add[1] = 0;
	if(GPIO_ReadInputDataBit(ADD_BIT2_PORT,ADD_BIT2_PIN)==0) sw_add[2] = 1;
			else sw_add[2] = 0;
	if(GPIO_ReadInputDataBit(ADD_BIT3_PORT,ADD_BIT3_PIN)==0) sw_add[3] = 1;
			else sw_add[3] = 0;
	if(GPIO_ReadInputDataBit(ADD_BIT4_PORT,ADD_BIT4_PIN)==0) sw_add[4] = 1;
			else sw_add[4] = 0;
	if(GPIO_ReadInputDataBit(ADD_BIT5_PORT,ADD_BIT5_PIN)==0) sw_add[5] = 1;
			else sw_add[5] = 0;
	if(GPIO_ReadInputDataBit(ADD_BIT6_PORT,ADD_BIT6_PIN)==0) sw_add[6] = 1;
			else sw_add[6] = 0;
	if(GPIO_ReadInputDataBit(ADD_BIT7_PORT,ADD_BIT7_PIN)==0) sw_add[7] = 1;
			else sw_add[7] = 0;

	value_dip = 1*sw_add[7]+2*sw_add[6]+4*sw_add[5]+8*sw_add[4]+16*sw_add[3]+32*sw_add[2]+64*sw_add[1]+128*sw_add[0];
	//if(value_dip == 0) value_dip=60; 
}
static int 		turn_on_dk1(void){
	if(!LEDStatus){
	TM_GPIO_SetPinHigh(RELAY_DK1_PORT,RELAY_DK1_PIN);
	TM_GPIO_SetPinHigh(RELAY_DK2_PORT,RELAY_DK2_PIN);
	LEDStatus=1;
	flag_pass=1;
	return 1;
	}
	else return 0;
}
static int 		turn_off_dk1(void){
	TM_GPIO_SetPinLow(RELAY_DK1_PORT,RELAY_DK1_PIN);
	TM_GPIO_SetPinLow(RELAY_DK2_PORT,RELAY_DK2_PIN);
	LEDStatus=0;
	return 0;
}
static int		turn_on_dk2(void){
	if(!LEDStatus){
	TM_GPIO_SetPinHigh(RELAY_DK2_PORT,RELAY_DK2_PIN);
	LEDStatus=2;
	return 1;
	}
	else return 0;
}
static int 		turn_off_dk2(void){
	TM_GPIO_SetPinLow(RELAY_DK2_PORT,RELAY_DK2_PIN);
	LEDStatus=0;
	return 0;
}
static int		turn_off_dk3(void){
	TM_GPIO_SetPinHigh(RELAY_DK3_PORT,RELAY_DK3_PIN);
	return 0;
}
static int 		turn_on_dk3(void){
	TM_GPIO_SetPinLow(RELAY_DK3_PORT,RELAY_DK3_PIN);
	TM_USART_Puts(USART3,Carpull);
	return 0;
}
static int		turn_off_dk4(void){
	TM_GPIO_SetPinHigh(RELAY_DK4_PORT,RELAY_DK4_PIN);
	return 0;
}
static int 		turn_on_dk4(void){
	TM_GPIO_SetPinLow(RELAY_DK4_PORT,RELAY_DK4_PIN);
	TM_USART_Puts(USART3,Carpush);
	return 0;
}
static int 		check_vip(char * name){							// check IDcar
	int i =0;
	for(i=0;i<3;i++){
	if(strstr(name,vip_id[i]))
		return 1;
	}
	return 0;
}
static void 	updatime(uint8_t h,uint8_t m,uint8_t s,uint8_t d,uint8_t mon,uint8_t year){ // Up datetime 
			datatime.hours = h;
			datatime.minutes = m;
			datatime.seconds = s;
			datatime.year = year;
			datatime.month = mon;
			datatime.date = d;
			/* Set new time */
			TM_RTC_SetDateTime(&datatime, TM_RTC_Format_BIN);
}
static void 	Sttup(char * buffer){		// 		
		static int i	// thong tin tk
							,j	// so du tk
							,k	// gia dich vu
							,h	// so luot khach di qua
							,l=0;	//
		sscanf(buffer,"%d-%d-%d-%d-%d",&i,&j,&k,&h,&l);
		status_sv=i;
		if(malenh_sv==1)	flag_status_sv=1;
}
static void 	Timeup(char * buffer){
		static int h, m, s, d, mon, year;
		sscanf(buffer,"%d-%d-%d/%d-%d-%d",&h,&m,&s,&d,&mon,&year);
		updatime(h,m,s,d,mon,year);
}
uint8_t 			crc_26bit(uint32_t allnum_bit,uint32_t wiegand){
	uint32_t wiegand1_tam = 0;
	uint32_t a = 0, b = 0;
	uint32_t icount = 0;
	
	if((wiegand & 0xFC000000) != 0)
		return 0;
	if(allnum_bit != 26)
		return 0;
	wiegand1_tam = wiegand;
	for(icount = 1;icount <= 12;icount++){
		if((wiegand1_tam >>= 1)& 1)
			b++;
	}
	b = (b%2)?0:1;  // CRC le
	for(icount = 1;icount <= 12;icount++){
		if((wiegand1_tam >>= 1)& 1)
			a++;
	}
	a %= 2;	        // CRC chan
	
	wiegand1_tam = wiegand;
	if((a == wiegand1_tam >> 25) && (b == (wiegand1_tam & 1)))
		return 1;
	else
		return 0;
}
uint8_t 			crc_34bit(uint32_t allnum_bit,uint64_t wiegand){
	uint64_t wiegand1_tam = 0;
	uint32_t a = 0, b = 0;
	uint32_t icount = 0;
	
	if(allnum_bit != 34)
		return 0;
	wiegand1_tam = wiegand;
	for(icount = 1;icount <= 16;icount++){
		if((wiegand1_tam >>= 1)& 1)
			b++;
	}
	b = (b%2)?0:1;  // CRC le
	for(icount = 1;icount <= 16;icount++){
		if((wiegand1_tam >>= 1)& 1)
			a++;
	}
	a %= 2;	        // CRC chan
	
	wiegand1_tam = wiegand;
	if((a == wiegand1_tam >> 33) && (b == (wiegand1_tam & 1)))
		return 1;
	else
		return 0;
}

